#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
#include<windows.h>
//浮点数在内存中的存储
//int main()
//{
//	int n = 9;
//	//0 00000000 00000000000000000001001
//	float* pFloat = (float*)&n;
//	printf("n的值为:%d\n,n");
//	printf("*pFloat的值为:%f\n", *pFloat);
//	//(-1)^0*0.00000000000000000001001*2^-126
//
//
//
//
//	*pFloat = 9.0;
//	//1001.0
//	//1.001*2^-3
//	//(-1)^0*1.001*2^3
//	//01000001000100000000000000000000
//	printf("num的值为:%d\n", n);
//	printf("pFloat的值为：%f\n", *pFloat);
//	return 0;
//}





//无符号char 0-255
//死循环
//unsigned char  i = 0;
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");
//	}
//
//	return 0;
//}







//有符号char ->   -128-127
//
//int main()
//{
//	char a[1000];
//	int i = 0;
//	for (i = 0; i < 1000; i++)
//	{
//		
//		a[i]=-1-i;//  -1,-2,-3....-128....-1000;->   -1,-2,-3......-128  127....3,2,1,0=128+127=255
//	}
//	printf("%d\n", strlen(a));
//	return 0;
//}





//int main()
//{
//	int i = -20;
//	unsigned int j = 10;
//	printf("%d\n", i + j);
//	return 0;
//}








//有符号char的范围  -128->127
//无符号char的范围  0->255
//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000
//	//11111111111111111111111101111111
//	//11111111111111111111111110000000 补码
//	//10000000
//	//11111111111111111111111110000000 补码整形提升
//	printf("%u\n", a);
//	//%d -打印十进制的有符号数字
//	//%u -打印十进制的无符号数字
//
//
//	return 0;
//}